{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda", "name": "lambda_3", "trainable": true, "output_shape": null, "batch_input_shape": [null, 64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-22-c3389cbc80b9>\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 24, "trainable": true, "bias": true, "nb_col": 5, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_5", "subsample": [2, 2], "border_mode": "valid", "activation": "relu", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 36, "trainable": true, "bias": true, "nb_col": 5, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_6", "subsample": [2, 2], "border_mode": "valid", "activation": "relu", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 48, "trainable": true, "bias": true, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_7", "subsample": [2, 2], "border_mode": "valid", "activation": "relu", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 64, "trainable": true, "bias": true, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_8", "subsample": [1, 1], "border_mode": "valid", "activation": "relu", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.8, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 1164, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "dense_6", "b_constraint": null, "activation": "linear", "input_dim": 576, "b_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 100, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "dense_7", "b_constraint": null, "activation": "linear", "input_dim": 1164, "b_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 50, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "dense_8", "b_constraint": null, "activation": "linear", "input_dim": 100, "b_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 10, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "dense_9", "b_constraint": null, "activation": "linear", "input_dim": 50, "b_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 1, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "dense_10", "b_constraint": null, "activation": "linear", "input_dim": 10, "b_regularizer": null}}]}