{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-4-15d87130891f>\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 64, 3], "trainable": true, "output_shape_type": "raw", "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 24, "nb_row": 5, "name": "convolution2d_1", "activation": "relu", "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "bias": true, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 36, "nb_row": 5, "name": "convolution2d_2", "activation": "relu", "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "bias": true, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 48, "nb_row": 3, "name": "convolution2d_3", "activation": "relu", "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "bias": true, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "nb_filter": 64, "nb_row": 3, "name": "convolution2d_4", "activation": "relu", "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "bias": true, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "nb_col": 3}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.8, "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1164, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "input_dim": 576, "trainable": true, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"output_dim": 100, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "input_dim": 1164, "trainable": true, "name": "dense_2", "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"output_dim": 50, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "input_dim": 100, "trainable": true, "name": "dense_3", "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"output_dim": 10, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "input_dim": 50, "trainable": true, "name": "dense_4", "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"output_dim": 1, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "input_dim": 10, "trainable": true, "name": "dense_5", "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform"}}], "keras_version": "1.2.1"}